#include <stdio.h>

int main (int argc, int **argv)

{
	system ("chcp 1253");

	int n;                         	                                          // Δήλωση μεταβλητών										  
	int pow;
	int evens = 0;                                                            // Αρχικοποίηση μεταβλητών
	int neg = 0;										                      // Αρχικοποίηση μεταβλητών
	int prod = 1;                                                             // Αρχικοποίηση μεταβλητών
	int pos = 0;                                                              // Αρχικοποίηση μεταβλητών
	int sum = 0;									                          // Αρχικοποίηση μεταβλητών
	float avg;
 	
	printf ("===================================================\n\n");
	printf ("Μαθηματικές πράξεις με ακέραιους αριθμούς\n\n");                 // Τίτλος του προγράμματος
	printf ("===================================================\n\n"); 	
	do 			                                                              /* Βρόχος */
	{
		printf ("--------------------------------------------------\n\n");
		printf ("Εισάγετε ακέραιο αριθμό : ");                              
		scanf ("%d", &n);                                                     // Εισαγωγή των ακεραίων αριθμών
		printf ("\n--------------------------------------------------\n\n");
		printf ("Ο ακέραιος αριθμός     : [%20d]\n\n", n);                    // Εκτύπωση των ακεραίων αριθμών
		if (n != 0)	                                                          /* (~) Εισαγωγή τιμής διάφορης του "0" */
		{
			if (n % 2 != 0)                                                   /* (!) Εισαγωγή περιττού αριθμού */
			{
				pow = n * n;                                                  // Υπολογισμός του τετραγώνου του περιττού
				printf ("Τετράγωνο περιττού     : [%20d]\n\n", pow);          // Εκτύπωση του τετραγώνου του περιττού
				printf ("\nΠεριττός αριθμός\n");
			}
			else 										                      /* (!) Εισαγωγή άρτιου αριθμού */	
			{
				evens++;								                      // Υπολογισμός του πλήθους των άρτιων αριθμών
				printf ("\nΆρτιος αριθμός\n");
			}
			if (n > 0)									                      /* (+) Εισαγωγή θετικού αριθμού */
			{
				pos++;							                              // Υπολογισμός του πλήθους των θετικών αριθμών
				sum = sum + n;							                      // Υπολογισμός του αθροίσματος των θετικών αριθμών 
				avg = (float) sum / pos; 			                          // Υπολογισμός του μέσου όρου των θετικών αριθμών
			}
			else										                      /* (+) Εισαγωγή αρνητικού αριθμού */
			{
				neg++;							                              // Υπολογισμός του πλήθους των αρνητικών αριθμών
				prod = prod * n;                                              // Υπολογισμός του γινομένου των αρνητικών αριθμών
			}
		}
		else											                      /* (~) Εισαγωγή  της τιμής "0" */
		{
			printf ("\n~Τέλος βρόχου~\n");                
	 	}
	}
	while (n != 0);                                        
	
	if (neg != 0)									                          /* (-) Ένας ή περισσότεροι αρνητικοί αριθμοί */
	{													   
		printf ("--------------------------------------------------\n\n"); 
		printf ("Πλήθος άρτιων          : [%20d]\n", evens);                  // Εκτύπωση του πλήθους των άρτιων αριθμών
		printf ("Μέσος όρος θετικών     : [%20.6f]\n", avg);                  // Εκτύπωση του μέσου όρου των θετικών αριθμών
		printf ("Γινόμενο αρνητικών     : [%20d]\n", prod);                   // Εκτύπωση του γινομένου των αρνητικών αριθμών
	}
	else												                      /* (-) Κανένας αρνητικός αριθμός */
	{
		printf ("--------------------------------------------------\n\n"); 
		prod--;                                                               // Εκχώρηση τιμής "0" στη μεταβλητή "prod"
		printf ("Πλήθος άρτιων          : [%20d]\n", evens);                  // Εκτύπωση του πλήθους των άρτιων αριθμών
		printf ("Μέσος όρος θετικών     : [%20.6f]\n", avg);                  // Εκτύπωση του μέσου όρου των θετικών αριθμών
		printf ("Γινόμενο αρνητικών     : [%20d]\n", prod);                   // Εκτύπωση του γινομένου των αρνητικών αριθμών
	}
	
	return 0;
}
