#include <stdio.h>
#include <math.h>
#define pi 3.14159                                                            

int main (int argc, char **argv)
{
	system ("chcp 1253");
	
	double deg, rad;                                                           // Δήλωση μεταβλητών
	double sine;
	double term, next_term, diff_terms, abs_diff_terms, first_sin_T;
	double diff_sin_T, abs_diff_sin_T;
	double sin_T = 0.0;                                                        // Αρχικοποίηση μεταβλητών
	int i;
	int j = 1;                                                                 // Αρχικοποίηση μεταβλητών
	int sign = -1;                                                             // Αρχικοποίηση μεταβλητών
	
	printf ("========================================================\n\n");
	printf ("Υπολογισμός του ημιτόνου μίας γωνίας\n\n");       				   // Ο τίτλος του προγράμματος
	printf ("========================================================\n\n");
	printf ("Εισάγετε γωνία στο διάστημα του 1ου κύκλου [0,360]\n\n");             
	printf ("Μοίρες  : ");                                                     
	scanf ("%lf", &deg);                                                       // Εισαγωγή της γωνίας σε μοίρες
	printf ("\n--------------------------------------------------------\n\n"); 
	rad = (pi * deg) / 180;                                                    // Μετατροπή της γωνίας από μοίρες σε ακτίνια
	printf ("Μοίρες  : [%20.6lf]\n", deg);                                     // Εκτύπωση της γωνίας σε μοίρες
	printf ("Ακτίνια : [%20.6lf]\n\n", rad);	                               // Εκτύπωση της γωνίας σε ακτίνια
	sine = sin (rad);                                                          // Υπολογισμός του ημιτόνου της γωνίας με τη συνάρτηση "sin (ω)"
	do                                                                         /* 1ος Βρόχος */
	{
		term = 1;                                                              // Αρχικοποίηση μεταβλητής του πρώτου όρου, του δευτέρου ...  
		for (i = 1 ; i <= j ; i++)                                             /* 2ος Βρόχος */
		{
			term = term * (rad / i);                                           // Υπολογισμός του πρώτου όρου, του δευτέρου ... (ω^1 / 1!, ω^3 / 3! ...)
		}
		j = j + 2;                                                             // Αύξηση της βοηθητικής μεταβλητής για τον υπολογισμό του δευτέρου όρου, του τρίτου ...                                   
		next_term =  term * ((rad * rad) / (j * (j - 1)));                     // Υπολογισμός του δευτέρου όρου, του τρίτου ... (ω^3 / 3!, ω^5 / 5! ...)
		diff_terms = next_term - term;                                         // Υπολογισμός της διαφοράς του δευτέρου όρου με τον πρώτο, του τρίτου με τον δεύτερο ...
		abs_diff_terms = fabs (diff_terms);                                    // Υπολογισμός της απόλυτης τιμής της διαφοράς 
		if (j == 3)                                                            /* (~) 1η επανάληψη του 1ου βρόχου */ 
		{                                                                      /* ω^1 / 1! - ω^3 / 3! */ 
			first_sin_T = term + (sign * next_term); 					       // Υπολογισμός του πρώτου αθροίσματος με το κατάλληλο πρόσημο "sign" 
			sin_T = sin_T + first_sin_T;                                       // Καταχώρηση του αθροίσματος στη μεταβλητή "sin_t"
			sign = sign * (-1);                                                // Αλλαγή προσήμου
		}
		else                                                                   /* (~) 2η, 3η ... επανάληψη του 1ου βρόχου */
		{                                                                      /* (ω^1 / 1! - ω^3 / 3!) + ω^5 / 5! ... */
			sin_T = sin_T + (sign * next_term); 							   // Υπολογισμός του δευτέρου αθροίσματος, του τρίτου ... με το κατάλληλο πρόσημο "sign" 
			sign = sign * (-1);                                                // Αλλαγή προσήμου
		}
	}
	while (abs_diff_terms > 0.000001);                                              
	
	printf ("Sine    : [%20.6lf]\n", sine);                                    // Εκτύπωση του ημιτόνου της γωνίας με την έτοιμη συνάρτηση "sin (ω)"                                                   
	printf ("Taylor  : [%20.6lf]\n\n", sin_T);                                 // Εκτύπωση του ημιτόνου της γωνίας με την απειροσειρά "Taylor"
	diff_sin_T = sine - sin_T;                                                 // Υπολογισμός της διαφοράς του ημιτόνου με την απειροσειρά "Taylor"
	abs_diff_sin_T = fabs (diff_sin_T);                                        // Υπολογισμός της απόλυτης τιμής της διαφοράς του ημιτόνου με την απειροσειρά "Taylor"
	if (abs_diff_sin_T <= 0.0000009)                                           /* (~) Αποδεκτή απόλυτη τιμή της διαφοράς του ημιτόνου με την απειροσειρά "Taylor" */
	{
		printf ("Sine ~= Taylor\n"); 
		printf ("Οι δύο αριθμοί είναι σχεδόν ίσοι\n");                     
	}
	else                                                                       /* (~) Απορριπτέα απόλυτη τιμή της διαφοράς του ημιτόνου με την απειροσειρά "Taylor" */
	{
		printf ("Sine != Taylor\n");  
		printf ("Οι δύο αριθμοί δεν είναι σχεδόν ίσοι\n");                                                   
	}
	
	return 0;                   
}
