#include <stdio.h>

int main (int argc, char **argv)

{
	system ("chcp 1253");
	
	int lines;                                                               // Δήλωση μεταβλητών                                          
	int i, j, k;
	
	printf ("===================================================\n\n");
	printf ("Σχήματα με αστερίσκους\n\n");                                   // Τίτλος προγράμματος
	printf ("===================================================\n\n");
	printf ("Εισάγετε αριθμό γραμμών : ");                              
	scanf ("%d", &lines);                                                    // Εισαγωγή του πλήθους των γραμμών
		printf ("\n--------------------------------------------------\n\n");
	for (i = 1 ; i <= lines ; i++)                                           /* 1ο σχήμα */
	{
		for (j = 1 ; j <= i ; j++)
		{
			printf ("*");
		}
		printf ("\n");
	}
	printf ("\n--------------------------------------------------\n\n");
	for (i = 0 ; i < lines ; i++)                                            /* 2ο σχήμα */
	{
		for (j = lines - 1 ; j > i ; j--)
		{
			printf (" ");
		}
		for (k = 0 ; k <= j ; k++)
		{
			printf ("*");
		}
		printf ("\n");
	}
		printf ("\n--------------------------------------------------\n\n");
	for (i = 0 ; i < lines ; i++)                                            /* 3ο σχήμα */
	{
		for (j = lines - 1 ; j > i ; j--)
		{
			printf (" ");
		}
		for (k = 0 ; k <= j * 2 ; k++)
		{
			printf ("*");
		}
		printf ("\n");
	}
	printf ("\n--------------------------------------------------\n\n");
	for (i = 0 ; i < lines ; i++)                                            /* 4ο σχήμα */
	{
		for (j = 0 ; j < lines ; j++)
		{
			if (i == 0 || j == 0 || i == lines - 1 || j == lines - 1)        /* (~) Σημείο εντός της περιμέτρου του σχήματος */
			{
				printf ("*");
			}
			else													         /* (~) Σημείο εκτός της περιμέτρου του σχήματος */
			{
				if (i == j)                                                  /* (!) Σημείο εντός της κύριας διαγωνίου */
				{
					printf (".");
				}
				else                                                         /* (!) Σημείο εκτός της κύριας διαγωνίου */
				{
					if (i + j == lines - 1)                                  /* (+) Σημείο εντός της δευτερεύουσας διαγωνίου */
					{
						printf (".");
					}
					else                                                     /* (+) Σημείο εκτός της δευτερεύουσας διαγωνίου */
					{
						printf (" ");
					}
				}
			}	
		}
		printf ("\n");
	}

	return 0;
}
